# Author：jingyile
# Data:2020/3/19 下午3:36
# Des:测试

import numpy as np
import scipy.spatial.distance as dist
from numpy import *

test =np.array([[1,1,0,0,1],
                [0,1,0,1,0],
                [1,1,1,1,1],
                [1,1,0,1,0],
                [1,1,0,0,1],
                [0,0,0,1,0],
                [1,0,0,0,0]])
result = 1-dist.pdist(test.T, 'jaccard')
dot1=np.dot(test.T,test)     # 两物品同时发生的次数...
'''
array([[5, 4, 1, 2, 3],
       [4, 5, 1, 3, 3],
       [1, 1, 1, 1, 1],
       [2, 3, 1, 4, 1],
       [3, 3, 1, 1, 3]])

'''
test2=(test-1)*-1             # 0变1,1变0   可表示出一个被浏览的情况
'''
array([[0, 0, 1, 1, 0],
       [1, 0, 1, 0, 1],
       [0, 0, 0, 0, 0],
       [0, 0, 1, 0, 1],
       [0, 0, 1, 1, 0],
       [1, 1, 1, 0, 1],
       [0, 1, 1, 1, 1]])

'''
dot2=np.dot(test2.T,test)       # 其中一个被浏览
'''
array([[0, 1, 0, 2, 0],
       [1, 0, 0, 1, 0],
       [4, 4, 0, 3, 2],
       [3, 2, 0, 0, 2],
       [2, 2, 0, 3, 0]])


'''
dot3 = dot2.T+dot2          # 任意两个网址中随意一个被浏览的次数
'''
array([[0, 2, 4, 5, 2],
       [2, 0, 4, 3, 2],
       [4, 4, 0, 3, 2],
       [5, 3, 3, 0, 5],
       [2, 2, 2, 5, 0]])


'''
res=dot1/(dot1+dot3)

'''
array([[1.        , 0.66666667, 0.2       , 0.28571429, 0.6       ],
       [0.66666667, 1.        , 0.2       , 0.5       , 0.6       ],
       [0.2       , 0.2       , 1.        , 0.25      , 0.33333333],
       [0.28571429, 0.5       , 0.25      , 1.        , 0.16666667],
       [0.6       , 0.6       , 0.33333333, 0.16666667, 1.        ]])
'''




























# lenr = 5
# # lenc = 8
# arr=np.zeros(shape=(80,80))
# for i in range(0,4):
#     a = 0
#     b = 0
#     c = 0
#     for j in range(0,8):
#         if test[j][i]+test[j][i+1] == 2:
#             a = a+1
#             c = c+1
#         if test[j][i] + test[j][i+1] == 1:
#             c = c+1
#     print(a)
#     print(c)
#     print('...')
# # print(test[i][j])